###############################################################
#  Generated by:      Cadence Innovus 15.23-s045_1
#  OS:                Linux x86_64(Host ID ieng6-ece-04.ucsd.edu)
#  Generated on:      Mon Mar 10 16:22:02 2025
#  Design:            mac_array
#  Command:           saveDesign route.enc
###############################################################
current_design mac_array
create_clock [get_ports {clk}]  -name clk -period 1.000000 -waveform {0.000000 0.500000}
set_propagated_clock  [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {inst[1]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[1]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[14]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[21]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[62]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[55]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[48]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[10]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[51]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[44]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[37]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[6]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[19]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[26]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[40]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[33]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[2]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[15]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[22]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[63]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[56]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[49]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[11]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[52]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[45]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[38]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[7]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[41]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[34]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[27]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[3]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[16]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[23]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[30]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[57]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[12]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[60]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[53]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[46]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[39]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[8]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[42]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[35]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[28]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[4]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[17]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[24]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[58]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[31]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {inst[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[13]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[20]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[61]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[54]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[47]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[9]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[50]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[43]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[36]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[29]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[5]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[18]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[25]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[32]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {in[59]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[4]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[2]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[0]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[19]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[17]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[15]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[9]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[13]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[20]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[7]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[11]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[5]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {fifo_wr[0]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[3]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[1]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[18]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[16]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[14]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[21]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[8]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[12]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[6]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {out[10]}]
set_clock_uncertainty 0 [get_clocks {clk}]
